<<<<<<<<ISP1 RTR Configuration>>>>>>>>>>


ISP1# ip route 11.11.11.11 255.255.255.255 17.9.1.2
ISP1# ip route 11.11.11.11 255.255.255.255 17.9.1.6

After that we can ping RTR1 loopback interface 11.11.11.11

R1#ip route 1.1.1.1 255.255.255.255 17.9.1.1
R1#ip route 1.1.1.1 255.255.255.255 17.9.1.5

Now config eBGP on ISP1:

ISP1#router bgp 200
ISP1#neighbour 11.11.11.11 remote-as 500
ISP1#neighbour 11.11.11.11 update-source loopback 0


Now mirror config eBGP on R1:

R1#router bgp 500
R1#neighbor 1.1.1.1 remote-as 200
R1#neighbor 1.1.1.1 update-source loopback 0

Now:

ISP1# sh ip bgp summary ---> neighbor in Idle State (Why?)
ISP1# sh bgp neighbors ---> reason ----> "External eBGP neighbor is not directly connected"

OK ) ---> resolution

ISP1#router bgp 500
ISP1#neighbor 11.11.11.11 ebgp-multihop 2





