<<<<<<<<ISP1 RTR Configuration>>>>>>>>>>


ISP1# ip route 11.11.11.11 255.255.255.255 17.9.1.2
ISP1# ip route 11.11.11.11 255.255.255.255 17.9.1.6

After that we can ping RTR1 loopback interface 11.11.11.11

R1#ip route 1.1.1.1 255.255.255.255 17.9.1.1
R1#ip route 1.1.1.1 255.255.255.255 17.9.1.5

Now config eBGP on ISP1:

ISP1#router bgp 200
ISP1#neighbour 11.11.11.11 remote-as 500
ISP1#neighbour 11.11.11.11 update-source loopback 0


Now mirror config eBGP on R1:

R1#router bgp 500
R1#neighbor 1.1.1.1 remote-as 200
R1#neighbor 1.1.1.1 update-source loopback 0

Now:

ISP1# sh ip bgp summary ---> neighbor in Idle State (Why?)
ISP1# sh bgp neighbors ---> reason ----> "External eBGP neighbor is not directly connected"

OK ) ---> resolution

ISP1#router bgp 500
ISP1#neighbor 11.11.11.11 ebgp-multihop 2

Do the same for R1:

R1#router bgp 500
R1#neighbor 1.1.1.1 ebgp-multihop 2

R1# do sh ip bgp


ISP2# 

ip route 22.22.22.22 255.255.255.255 180.1.5.2
ip route 22.22.22.22 255.255.255.255 180.1.5.6

router bgp 300
neighbor 22.22.22.22 remote-as 500
neighbor 22.22.22.22 description NL ISP - R2
neighbor 22.22.22.22 ebgp-multihop 2
neighbor 22.22.22.22 update-source Loopback1

R2#

ip route 255.255.255.255 180.1.5.1
ip route 255.255.255.255 180.1.5.5

router bgp 500
neighbor 2.2.2.1 remote-as 300
neighbor 2.2.2.1 description Uplink ISP2
neighbor 2.2.2.1 ebgp-multihop 2
neighbor 2.2.2.1 update-source Loopback0








